package com.ziroom.minsu.valenum.search;

/**
 * <p>搜索的权重
 *
     因子		权重	5分	4分	3分	2分	1分
     房源日历更新时间	28%	4%	x<=1天	1天<x<=2天	2天<x<=3天	3天<x<=7天	x>7天
     面积（整租）		6%	x>140	100<x<=140	80<x<=100	60<x<=80	x<=60
     面积（合租）		6%	x>25	20<x<=25	15<x<=20	10<x<=25	x<10
     价格（整租）		10%	500元<x<=600元	600元<x<=700元
     400元<x<=500元	700元<x<=800元
     300元<x<=400元	800元<x<=1000元
     200元<x<=300元	x>1000元
     x<=200元
     价格（合租）		10%	250元<x<=300元	300元<x<=350元
     200元<x<=250元	350元<x<=400元
     150元<x<=200元	400元<x<=500元
     100元<x<=150元	x>500元
     x<=100元
     房源品质等级	6%	6%	B<x<=A	 	            C<x<=B	                x<=C	
     商圈热度	14%	5%	95<x<=100	90<x<=95	85<x<=90	80<x<=85	x<=80
     商圈距离(米)		4%	x<=500	500<x<=1500	1500<x<=2500	2500<=x<3500	x>3500
     地铁距离（米）		5%	x<=500	500<x<=1500	1500<x<=2500	2500<=x<3500	x>3500
     有效订单数	28%	7%	x<=Top10%	Top10%<x<=25% 	Top25%<x<=35%	Top35%<x<=45%	x>45%
     有效订单占比		7%	90%<x<=100%	80%<x<=90%	70%<x<=80%	60%<x<=70%	x<=60%
     评价数量占比		10%	90%<x<=100%	80%<x<=90%	70%<x<=80%	60%<x<=70%	x<=60%
     立即预定		6%
     浏览量		4%	x<=Top10%	Top10%<x<=25% 	Top25%<x<=35%	Top35%<x<=45%	x>45%
     申请预订回复率	30%	5%	x>=90%	90%<x<=80%	80%<x<=70%	70%<x<=50%	x<50%
     申请预订拒绝率		8%	x<=10%	10%<x<=20%	20%<x<=30%	30%<x<=50%	x>50%
     申请预订回复时间		6%	x<=5	5<x<=20	20<x<=35	35<x<=60	x>60
     IM回复率		5%	x>=90%	90%<x<=80%	80%<x<=70%	70%<x<=50%	x<50%
     IM回复时间		6%	x<=5	5<x<=10	10<x<=15	15<x<=30	x>30
     房源发布时间	12%	12%	[1,5]间的随机分数，保留一位小数
     管理权重		12%	实际分数	实际分数	实际分数	实际分数	实际分数
 * </p>
 * <p/>
 * <PRE>
 * <BR>	修改记录
 * <BR>-----------------------------------------------
 * <BR>	修改日期			修改人			修改内容
 * </PRE>
 *
 * @author afi on 2016/8/15.
 * @version 1.0
 * @since 1.0
 */
public enum SoreWeightEnum {

    //房源基本属性因子【25】、房源距离属性因子【15】、房源交易属性因子【30】、房东行为属性因子【30】 附加因子等5大类因子【12】
    //因子		权重	5分	4分	3分	2分	1分

    /**
     * 4%
     * 计算当前的刷新时间的权重  更新时间：x<=1天：5分；1<x<=2天：4分；2<x<=3天：3分；3<x<=7天：2分；x>7天：1分；
     */
    base_refresh_date(11,"房源的刷新时间，和修改日历的时间"),
    /**
     * 8%
     * 面积（整租）       x>140	100<x<=140	80<x<=100	60<x<=80	x<=60
     * 面积（合租）		x>30	25<x<=30	20<x<=25	10<x<=20	x<
     * 10
     */
    base_area(3,"房源或者房间的面积"),
    /**
     * 10%
     * 价格（整租） 500元<x<=600元	600元<x<=700元/400元<x<=500元  700元<x<=800元/300元<x<=400元  800元<x<=1000元/200元<x<=300元  x>1000元/x<=200元
     * 价格（合租） 5250元<x<=300元 300元<x<=350元/200元<x<=250元  350元<x<=400元/150元<x<=200元  400元<x<=500元/100元<x<=150元  x>500元/x<=100元
     */
    base_price(4,"整租合租的价格"),

    /**
     * 6%
     * 房源品质等级
     * B<x<=A	 	C<x<=B	x<=C
     */
    base_quality(8,"房源品质等级"),


    /**
     * 5%
     * 热度	95<x<=100	90<x<=95	85<x<=90	80<x<=85	x<=80
     */
    region_hot(5,"热度"),
    /**
     * 4%
     * 距离(米)	95<x<=100	90<x<=95	85<x<=90	80<x<=85	x<=80
     */
    region_dis(4,"距离"),
   
    
    /** 已经废弃（2016-12-05）新增评价数量
     * 5%
     * 地铁距离（米） x<=500	500<x<=1500	1500<x<=2500	2500<=x<3500	x>3500
     */
    region_subway_dis(5,"地铁距离"),


    /**
     * 7%
     * 有效订单数		x<=Top10%	Top10%<x<=25% 	Top25%<x<=35%	Top35%<x<=45%	x>45%
     */
    trade_order_num(7,"有效订单数"),
    /**
     * 7%
     * 有效订单占比 90%<x<=100%	80%<x<=90%	70%<x<=80%	60%<x<=70%	x<=60%
     */
    trade_order_rate(7,"有效订单占比"),
    
    /**
     * 5%
     * 取消订单率		5%	x>30%	30%>=x>20%	20%>=x>10%	10%>=x>5%	x>0
     */
    trade_order_cancle(5,"取消订单率"),
    
    /**
     * 2016-12-05新增
     * 6%
     * 评价数量	6%	x<=Top10%	Top10%<x<=25%	Top25%<x<=35%	Top35%<x<=45%	x>45%
     */
    trade_eval(6,"评价数量"),
    
    /**
     * 8%
     * 评价数量占比	90%<x<=100%	80%<x<=90%	70%<x<=80%	60%<x<=70%	x<=60%
     */
    trade_eval_rate(8,"评价数量占比"),
    
    /**
     * 4%
     * 浏览量		x<=Top10%	Top10%<x<=25% 	Top25%<x<=35%	Top35%<x<=45%	x>45%
     */
    trade_pv(4,"浏览量"),

    /**
     * 5%
     * 申请预订回复率 x>=90%	90%<x<=80%	80%<x<=70%	70%<x<=50%	x<50%
     */
    reply_deal(5,"申请预订回复率"),
    /**
     * 8%
     * 申请预订拒绝率		8%	x<=10%	10%<x<=20%	20%<x<=30%	30%<x<=50%	x>50%
     */
    reply_refused(6,"申请预订拒绝率"),
    /**
     * 5%
     * 申请预订回复时间		6%	x<=5	5<x<=20	20<x<=35	35<x<=60	x>60
     */
    reply_time(6,"申请预订回复时间"),
    /**
     * 5%
     * IM回复率		5%	x>=90%	90%<x<=80%	80%<x<=70%	70%<x<=50%	x<50%
     */
    reply_im_rate(5,"IM回复率"),
    /**
     * 6%
     * IM回复时间		x<=5	5<x<=10	10<x<=15	15<x<=30	x>30
     */
    reply_im_time(4,"IM回复时间"),




    /**
     * 12%
     * 房源发布时间 [1,5]间的随机分数，保留一位小数
     */
    weight_time(12,"房源发布时间"),
    /**
     * 12%
     * 管理权重	12%
     */
    weight_manage(10,"管理权重"),
    
    /**
     * 
     * 立即预订	12%
     */
    immediately_book(12,"立即预订"),
    
    /**
     * 今夜特价  12%
     */
    weight_tonight_discount(12,"今夜特价"),
    
    /**
     * 是否与房东同住
     */
    weight_is_land_together(5, "是否与房东同住");

    SoreWeightEnum(int code, String name) {
        this.code = code;
        this.name = name;

    }

    /**
     * 获取优惠券活动类型
     * @param code
     * @return
     */
    public static SoreWeightEnum getByCode(int code){
        for(final SoreWeightEnum soreWeightEnum : SoreWeightEnum.values()){
            if(soreWeightEnum.getCode() == code){
                return soreWeightEnum;
            }
        }
        return null;
    }

    /** code */
    private int code;

    /** 名称 */
    private String name;

    public int getCode() {
        return code;
    }

    public String getName() {
        return name;
    }
}
