package com.ziroom.minsu.api.common.constant;

/**
 * <p></p>
 * <p>
 * <PRE>
 * <BR>	修改记录
 * <BR>-----------------------------------------------
 * <BR>	修改日期			修改人			修改内容
 * </PRE>
 *
 * @author lishaochuan on 2016/12/6 11:45
 * @version 1.0
 * @since 1.0
 */
public class RulesConst {


    /**
     * 立即预订
     */
    final public static String CREATE_ORDER_NOW = "您提交申请后， 不需要房东回复， 可以立即支付完成预订， 这是最快订上房子的下单类型。";

    /**
     * 申请预订
     */
    final public static String CREATE_ORDER_APPLY = "您提交申请后， 需要房东回复申请， 才能支付订单完成预订；\n\n" +
            "如果您不想等待， 可以尝试搜索【立即预订】 下单类型的房子，可以更快订上房子。";

    /**
     * 清洁费
     */
    final public static String CLEAN_FEE = "为了保证每一位客户拥有舒适整洁的入住体验，房东将收取清洁费用于退房后的房屋保洁。\n\n" +
            "无论您住几晚，此费用房东只收取一次。";


    /**
     * 押金
     */
    final public static String DEPOSIT_FEE = "您预订的房子是房东心爱的房屋，请您预订前仔细阅读【房屋守则】并遵守规则。\n\n" +
            "若入住期间违反【房屋守则】，退房后房东将可能根据实际情况扣取部分乃至全部押金。\n\n" +
            "正常情况下，房东将在退房后返还您的押金：\n\n" +
            "1、微信支付的用户，退款将在1-2个工作日内到账，建议优先使用微信支付；\n" +
            "2、绑定银行卡的用户，押金将在3个工作日内退还至银行卡；\n" +
            "3、未绑定银行卡的用户，我们将在次个工作日内退款至您的账户空间，您可以登陆自如网或自如APP提现，提现将在3个工作日内到账。\n";
    /**
     * 房客下单展示押金
     */
    final public static String DEPOSIT_FEE_TEN = "房东将收取一定的押金以保障心爱的房屋免受损害。\n" +
            "若您在入住期间违反【房屋守则】，退房后房东将根据实际情况扣取部分乃至全部押金。\n" +
            "正常情况下，房东将在退房后返还您的押金：\n" +
            "1、微信支付的用户，退款将在1-2个工作日内到账，建议优先使用微信支付；\n" +
            "2、绑定银行卡的用户，押金将在3个工作日内退还至银行卡；\n" +
            "3、未绑定银行卡的用户，我们将在次个工作日内退款至您的账户空间，您可以登陆自如网或自如APP提现，提现将在3个工作日内到账。\n" +
            "温馨提示：请您在预订前仔细阅读【房屋守则】并遵守规则避免被扣取押金哦。\n";

    /**
     * 预约须知
     */
    final public static String PHOTO_CONTENT = "1、请至少提前3天预约摄影服务，可选择上门日期，具体时间可在备注中添加；\n\n" +
            "2、预约提交后，摄影师将联系房东确认具体上门拍摄时间；\n\n" +
            "3、请确保上门拍摄的时间段内，无房客入住且房屋保持整洁美观；\n\n" +
            "4、摄影师上门前两个小时可取消预约，请您务必第一时间联系为您服务的摄影师更改拍摄时间；\n\n" +
            "5、预约拍摄成功后，摄影师会与房东确定上门拍摄时间，若出现因房东方面原因（包括房间未打扫完毕，临时预定未告之摄影师，联系不上房东等）导致摄影师上门无法拍摄，会由房东支付摄影师上门费用; \n\n" +
            "6、若房源属于偏远地区（包括镇、村等非城市核心地区）预约摄影后会由自如民宿摄影部与房东、摄影师协调后统一安排时间上门拍摄，希望房东了解并配合。 \n\n";

}